app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "last_request_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES('2010-09-09 08:44:15', '2010-09-09 08:44:15', '5839b2e65c1a4a27e1980c5a002a7dd9cb1f9eaf98b183b2248520525e1d0e48c396779b58ddad2fe6ebeaa090d749edfbe8c77d7c83fdb762b5c32d4ab46b9f', '2010-09-09 08:44:15', '127.0.0.1', 'rgv3d31Dd726wZb15o', '2010-09-09 08:44:15', '3429ee3ad3d2ba5a26468d1b542bb2cde3f64d8516198b6fbe77734b3a24a31bfad363092a709e83dc13924d295bc8c98f5f197ee6b9f26ac56a8367552531b9', 1, NULL, 'nkfeiyang', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "login_count" = 4, "persistence_token" = '1c3f3e6f0a38515526f3164719d5a27f49b4cb15e5ac32d01ee900edff9db4b7ecf0f18acba0819f510c9bf6a780f3eb96cca5431106c0a9d88d2c217e1fbbac', "updated_at" = '2010-09-09 09:23:05', "last_request_at" = '2010-09-09 09:23:05', "last_login_at" = '2010-09-09 09:22:03', "current_login_at" = '2010-09-09 09:23:05', "password_salt" = 'GQoB431KfMyxBqtqqNUs', "crypted_password" = '9805286d32ad295c982f6cb7e9778312262910fc4c6452d265dcf04d8808df1e516ac7595cf57694803db2d2b935194cfcd5302427a7cbe5c9c93c02cbc99495' WHERE "id" = 1
---
  def update
    @nav_title = @title = '个人信息更新'
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])